app/controllers/search_controller.rb

  def analytics
    @searches = Search.group(:query).count
---
SELECT COUNT(*) AS "count_all", "searches"."query" AS "searches_query" FROM "searches" GROUP BY "searches"."query"

  def log_search(query, ip)
    # Log the search query along with IP (e.g., save to a database)
    Search.create(query: query, ip: ip)
---
INSERT INTO "searches" ("query", "ip", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["query", "why?"], ["ip", "102.215.236.24"], ["created_at", "2024-01-13 03:34:58.791054"], ["updated_at", "2024-01-13 03:34:58.791054"]]

  def duplicate_entry?(query, ip)
    # Check for a duplicate entry with the same query and IP
    Search.exists?(query: query, ip: ip)
---
SELECT "searches".* FROM "searches"
SELECT 1 AS one FROM "searches" WHERE "searches"."query" = ? AND "searches"."ip" = ? LIMIT ?  [["query", "why?"], ["ip", "::1"], ["LIMIT", 1]]