app/controllers/search_controller.rb

  def user_logs
    # Retrieve all user log entries from the database
    @user_logs = Search.all
---
SELECT "searches".* FROM "searches"

  def retrieve_trends
    trends = Search.group(:query).count
    # Select only the trends that have a count of 2 or more
    trending_questions = trends.select { |_query, count| count >= 2 }
---
SELECT COUNT(*) AS "count_all", "searches"."query" AS "searches_query" FROM "searches" GROUP BY "searches"."query"

  def duplicate_entry?(query)
    # Check for a duplicate entry with the same query
    Search.exists?(query: query)
---
SELECT 1 AS one FROM "searches" WHERE "searches"."query" = ? LIMIT ?  [["query", "wher?"], ["LIMIT", 1]]